;; -*- no-byte-compile: t; -*-
  ;;; $DOOMDIR/packages.el
(package! ace-window)
(package! aggressive-indent)
(package! claude-code-emacs :recipe (:local-repo "~/repos/claude-code-emacs/"))
(package! websocket) ;; Required for claude-code-emacs MCP server communication
(package! consult-projectile :recipe (:host gitlab :repo "OlMon/consult-projectile"))
;(package! copilot
;  :recipe (:host github :repo "copilot-emacs/copilot.el" :files ("*.el")))
(package! ctrlf)
(package! deadgrep)
(package! dired-rsync)
(package! elegant-agenda-mode :recipe (:host github :repo "justinbarclay/elegant-agenda-mode"))
(package! exec-path-from-shell)
(package! fancy-dabbrev)
(package! google-this)
;; (package! greader)
(package! gptel)
(package! helpful)
(package! key-chord)
(package! org-ai)
(package! org-cliplink)
(package! org-roam :recipe (:host github :repo "jethrokuan/org-roam"))
(package! org-super-agenda)
(package! phi-search)
(package! real-auto-save)
(package! rust-mode)
(package! smartscan)
(package! speed-type)
(package! teleport)
(package! topsy)
(package! undo-tree)
(package! wrap-region)
;; (package! whisper :recipe (:local-repo "~/repos/whisper.el/"))
